ЧартерEDT.Расширение1/src/Documents/чартер_ПереносБорта/чартер_ПереносБорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>чартер_ПереносБорта</name>
  <registerRecords>InformationRegister.чартер_ПереносыРейсов</registerRecords>
  <registerRecords>InformationRegister.чартер_ЗаписьНаРейс</registerRecords>
  <attributes>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.чартер_ЗаписьНаРейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйРейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйРейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ПереносыРейсов/чартер_ПереносыРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_ПереносыРейсов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйРейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонечныйРейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.чартер_ЗаписьНаРейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Documents/чартер_ПереносБорта/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не чартеры_ОбщиеПроцедурыИФункцииСервер.ПроверитьДубльРегистрацииНаРейс(КонечныйРейс
																, ТабельныйНомер) Тогда 
		
		Движения.чартер_ПереносыРейсов.Записывать = Истина;	
		Запись = Движения.чартер_ПереносыРейсов.Добавить();
		
		Запись.Период				= ТекущаяДатаСеанса();
		Запись.Регистратор 			= Ссылка;	
		Запись.ДокументРегистрации  = ДокументРегистрации;
		Запись.Сотрудник  			= Сотрудник;	
		Запись.ИсходныйРейс     	= ИсходныйРейс;
		Запись.КонечныйРейс     	= КонечныйРейс;
		Запись.ПричинаПереноса		= ПричинаПереноса;	
		Запись.Исполнитель 			= SessionParameters.CurrentUser;
		Запись.ДатаИзменения 		= ТекущаяДатаСеанса();
		
		ПровестиДокументРегистрации(Отказ); 
	Иначе
		Отказ = Истина;
		ИнфоСообщение = СтрШаблон("Сотрудник с табельным номером %1 уже зарегистрирован на переносимый борт %2"
									, ТабельныйНомер, КонечныйРейс);
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(ИнфоСообщение);				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
    Если Не ПроверитьЗаполнение() Тогда      
        Возврат;  
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПровестиДокументРегистрации(Отказ)

	ДокументОбъект = ДокументРегистрации.ПолучитьОбъект();
	
	ДокументОбъект.Рейс = КонечныйРейс;
	ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + СтрШаблон(". Перенесен с Борт № %1"
																		, ИсходныйРейс.Наименование);
	ДокументОбъект.Исполнитель = SessionParameters.CurrentUser;
	ДокументОбъект.ДатаИзменения = ТекущаяДатаСеанса();

	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ИнфоСообщение = СтрШаблон("Исходный рейс %1 Заменен на %2"
								, ИсходныйРейс.Наименование, КонечныйРейс.Наименование);				
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(ИнфоСообщение);						
	Исключение
		Отказ = Истина;
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Не удалось изменить регистрацию сотрудника!");	    
	КонецПопытки; 
	
КонецПроцедуры 

#КонецОбласти  

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
